core/src/test/resources/soap-sample/soap-request-london.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cs="https://predic8.de/city-service">
    <s:Body>
        <cs:getCity>
            <name>London</name>
        </cs:getCity>
    </s:Body>
</s:Envelope>